import type { Question } from './types';

export const questions: Question[] = [
	{
		// type: 'multiple-choice',
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Ειδική' },
			b: { text: 'Πλάγια ερωτηματική' },
			c: { text: 'Αναφορική' },
			d: { text: 'Υποθετική', isCorrect: true }
		},
		citation: {
			pre: 'Τοιούτων δὲ ὄντων Θηραμένης εἶπεν ἐν ἐκκλησίᾳ ὅτι ',
			highlighted: 'εἰ βούλονται αὐτὸν πέμψαι παρά Λύσανδρον',
			post: ', εἰδὼς ἥξει Λακεδαιμονίους πότερον ἐξανδραποδίσασθαι τὴν πόλιν βουλόμενοι ἀντέχουσι περὶ τῶν τειχῶν ἢ πίστεως ἕνεκα. Πεμφθεὶς δὲ διέτριβε παρὰ Λυσάνδρῳ τρεῖς μῆνας καὶ πλείω, ἐπιτηρῶν ὁπότε Ἀθηναῖοι ἔμελλον διὰ τὸ ἐπιλελοιπέναι τὸν σῖτον ἅπαντα ὅ τι τις λέγοι ὁμολογήσειν.',
			source: {
				chapter: 2,
				verse: 16
			}
		}
		// book: 'xenophon'
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Πλάγια ερωτηματική' },
			b: { text: 'Αιτιολογική' },
			c: { text: 'Υποθετική' },
			d: { text: 'Χρονική', isCorrect: true }
		},
		citation: {
			pre: '',
			highlighted: 'Ἐπεὶ δὲ τὰ ἐν τῇ Λαμψάκῳ κατεστήσατο',
			post: ',  ἔπλει ἐπὶ τὸ Βυζάντιον καὶ Καλχηδόνα. Oἱ δ’ αὐτὸν ὑπεδέχοντο, τοὺς τῶν Ἀθηναίων φρουροὺς ὑποσπόνδους ἀφέντες· οἱ δὲ προδόντες Ἀλκιβιάδῃ τὸ Βυζάντιον τότε μὲν ἔφυγον εἰς τὸν Πόντον, ὕστερον δ’ εἰς Ἀθήνας καὶ ἐγένοντο Ἀθηναῖοι.',
			source: {
				chapter: 1,
				verse: 1
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Ενδοιαστική' },
			b: { text: 'Πλάγια ερωτηματική' },
			c: { text: 'Ειδική' },
			d: { text: 'Αναφορική', isCorrect: true }
		},
		citation: {
			pre: 'Λύσανδρος δὲ τούς τε φρουροὺς τῶν Ἀθηναίων καὶ εἴ τινά που ἄλλον ἴδοι Ἀθηναῖον, ἀπέπεμπεν εἰς τὰς Ἀθήνας, διδοὺς ἐκεῖσε μόνον πλέουσιν ἀσφάλειαν, ἄλλοθι δ’ οὔ, εἰδὼς ὅτι ',
			highlighted: 'ὅσῳ ἂν πλείους συλλεγῶσιν εἰς τὸ ἄστυ καὶ τὸν Πειραιᾶ',
			post: ', θᾶττον τῶν ἐπιτηδείων ἔνδειαν ἔσεσθαι. Καταλιπὼν δὲ Βυζαντίου καὶ Καλχηδόνος Σθενέλαον ἁρμοστὴν Λάκωνα, αὐτὸς ἀποπλεύσας εἰς Λάμψακον τὰς ναῦς ἐπεσκεύαζεν.',
			source: {
				chapter: 1,
				verse: 2
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Ενδοιαστική' },
			b: { text: 'Τελική' },
			c: { text: 'Αναφορική' },
			d: { text: 'Ειδική', isCorrect: true }
		},
		citation: {
			pre: 'Λύσανδρος δὲ τούς τε φρουροὺς τῶν Ἀθηναίων καὶ εἴ τινά που ἄλλον ἴδοι Ἀθηναῖον, ἀπέπεμπεν εἰς τὰς Ἀθήνας, διδοὺς ἐκεῖσε μόνον πλέουσιν ἀσφάλειαν, ἄλλοθι δ’ οὔ, εἰδὼς ',
			highlighted:
				'ὅτι ὅσῳ ἂν πλείους συλλεγῶσιν εἰς τὸ ἄστυ καὶ τὸν Πειραιᾶ, θᾶττον τῶν ἐπιτηδείων ἔνδειαν ἔσεσθαι',
			post: '. Καταλιπὼν δὲ Βυζαντίου καὶ Καλχηδόνος Σθενέλαον ἁρμοστὴν Λάκωνα, αὐτὸς ἀποπλεύσας εἰς Λάμψακον τὰς ναῦς ἐπεσκεύαζεν.',
			source: {
				chapter: 1,
				verse: 2
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αποτελεσματική' },
			b: { text: 'Τελική' },
			c: { text: 'Αιτιολογική' },
			d: { text: 'Αναφορική', isCorrect: true }
		},
		citation: {
			pre: 'Ἐν δὲ ταῖς Ἀθήναις τῆς Παράλου ἀφικομένης νυκτὸς ἐλέγετο ἡ συμφορά, καὶ οἰμωγὴ ἐκ τοῦ Πειραιῶς διὰ τῶν μακρῶν τειχῶν εἰς ἄστυ διῆκεν, ὁ ἕτερος τῷ ἑτέρῳ παραγγέλλων· ὥστ’ ἐκείνης τῆς νυκτὸς οὐδεὶς ἐκοιμήθη, οὐ μόνον τοὺς ἀπολωλότας πενθοῦντες, ἀλλὰ πολὺ μᾶλλον ἔτι αὐτοὶ ἑαυτούς, πείσεσθαι νομίζοντες ',
			highlighted:
				'οἷα ἐποίησαν Μηλίους τε Λακεδαιμονίων ἀποίκους ὄντας, κρατήσαντες πολιορκίᾳ, καὶ Ἱστιαιέας καὶ Σκιωναίους καὶ Τορωναίους καὶ Αἰγινήτας  καὶ ἄλλους πολλοὺς τῶν Ἑλλήνων',
			post: '.',
			source: {
				chapter: 1,
				verse: 3
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Παραχωρητική' },
			b: { text: 'Ενδοιαστική' },
			c: { text: 'Πλάγια ερωτηματική' },
			d: { text: 'Αναφορική', isCorrect: true }
		},
		citation: {
			pre: 'Ὑμεῖς δὲ λαβόντες καὶ ἀπαγαγόντες οἱ ἕνδεκα ',
			highlighted: 'οὗ δεῖ',
			post: ' τὰ ἐκ τούτων πράττετε». Ὡς δὲ ταῦτα εἶπεν, εἷλκε μὲν ἀπὸ τοῦ βωμοῦ ὁ Σάτυρος, εἷλκον δὲ οἱ ὑπηρέται. ὁ δὲ Θηραμένης ὥσπερ εἰκὸς καὶ θεοὺς ἐπεκαλεῖτο καὶ ἀνθρώπους καθορᾶν τὰ γιγνόμενα. Ἡ δὲ βουλὴ ἡσυχίαν εἶχεν, ὁρῶσα καὶ τοὺς ἐπὶ τοῖς δρυφάκτοις ὁμοίους Σατύρῳ καὶ τὸ ἔμπροσθεν τοῦ βουλευτηρίου πλῆρες τῶν φρουρῶν, καὶ οὐκ ἀγνοοῦντες ὅτι ἐγχειρίδια ἔχοντες παρῆσαν.',
			source: {
				chapter: 3,
				verse: 55
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Ειδική' },
			b: { text: 'Αναφορική' },
			c: { text: 'Τελική' },
			d: { text: 'Χρονική', isCorrect: true }
		},
		citation: {
			pre: 'Ὑμεῖς δὲ λαβόντες καὶ ἀπαγαγόντες οἱ ἕνδεκα οὗ δεῖ τὰ ἐκ τούτων πράττετε». ',
			highlighted: 'Ὡς δὲ ταῦτα εἶπεν',
			post: ', εἷλκε μὲν ἀπὸ τοῦ βωμοῦ ὁ Σάτυρος, εἷλκον δὲ οἱ ὑπηρέται. ὁ δὲ Θηραμένης ὥσπερ εἰκὸς καὶ θεοὺς ἐπεκαλεῖτο καὶ ἀνθρώπους καθορᾶν τὰ γιγνόμενα. Ἡ δὲ βουλὴ ἡσυχίαν εἶχεν, ὁρῶσα καὶ τοὺς ἐπὶ τοῖς δρυφάκτοις ὁμοίους Σατύρῳ καὶ τὸ ἔμπροσθεν τοῦ βουλευτηρίου πλῆρες τῶν φρουρῶν, καὶ οὐκ ἀγνοοῦντες ὅτι ἐγχειρίδια ἔχοντες παρῆσαν.',
			source: {
				chapter: 3,
				verse: 55
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Υποθετική' },
			b: { text: 'Χρονική' },
			c: { text: 'Τελική' },
			d: { text: 'Αναφορική', isCorrect: true }
		},
		citation: {
			pre: 'Ταῦτα δ’ εἰπὼν καὶ μεταστραφεὶς πρὸς τοὺς ἐναντίους, ἡσυχίαν εἶχε· καὶ γὰρ ὁ μάντις παρήγγελλεν αὐτοῖς μὴ πρότερον ἐπιτίθεσθαι, πρὶν [ἂν] τῶν σφετέρων ἢ πέσοι τις ἢ τρωθείη· «ἐπειδὰν μέντοι τοῦτο γένηται, ἡγησόμεθα μέν», ἔφη, «ἡμεῖς, νίκη δ’ ὑμῖν ἔσται ἑπομένοις, ἐμοὶ μέντοι θάνατος, ',
			highlighted: 'ὥς γέ μοι δοκεῖ',
			post: '».',
			source: {
				chapter: 4,
				verse: 18
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αναφορική' },
			b: { text: 'Ειδική' },
			c: { text: 'Αιτιολογική' },
			d: { text: 'Χρονική', isCorrect: true }
		},
		citation: {
			pre: 'Καὶ οὐκ ἐψεύσατο, ἀλλ’ ',
			highlighted: 'ἐπεὶ ἀνέλαβον τὰ ὅπλα',
			post: ', αὐτὸς μὲν ὥσπερ ὑπὸ μοίρας τινὸς ἀγόμενος ἐκπηδήσας πρῶτος ἐμπεσὼν τοῖς πολεμίοις ἀποθνῄσκει, καὶ τέθαπται ἐν τῇ διαβάσει τοῦ Κηφισοῦ· οἱ δ’ ἄλλοι ἐνίκων καὶ κατεδίωξαν μέχρι τοῦ ὁμαλοῦ. Ἀπέθανον δ’ ἐνταῦθα τῶν μὲν τριάκοντα Κριτίας τε καὶ Ἱππόμαχος, τῶν δὲ ἐν Πειραιεῖ δέκα ἀρχόντων Χαρμίδης ὁ Γλαύκωνος, τῶν δ’ ἄλλων περὶ ἑβδομήκοντα. Καὶ τὰ μὲν ὅπλα ἔλαβον, τοὺς δὲ χιτῶνας οὐδενὸς τῶν πολιτῶν ἐσκύλευσαν. Ἐπεὶ δὲ τοῦτο ἐγένετο καὶ τοὺς νεκροὺς ὑποσπόνδους ἀπεδίδοσαν, προσιόντες ἀλλήλοις πολλοὶ διελέγοντο.',
			source: {
				chapter: 4,
				verse: 19
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αναφορική' },
			b: { text: 'Ειδική' },
			c: { text: 'Αιτιολογική' },
			d: { text: 'Χρονική', isCorrect: true }
		},
		citation: {
			pre: 'Πρὸς θεῶν πατρῴων καὶ μητρῴων καὶ συγγενείας καὶ κηδεστίας καὶ ἑταιρίας, πάντων γὰρ τούτων πολλοὶ κοινωνοῦμεν ἀλλήλοις, αἰδούμενοι καὶ θεοὺς καὶ ἀνθρώπους παύσασθε ἁμαρτάνοντες εἰς τὴν πατρίδα, καὶ μὴ πείθεσθε τοῖς ἀνοσιωτάτοις τριάκοντα, ',
			highlighted: 'ἐπεὶ ἦσαν ἐν Σελλασίᾳ, ἐρωτώμενοι δὲ ἐπὶ τίνι λόγῳ ἥκοιεν εἶπον',
			post: '.',
			source: {
				chapter: 4,
				verse: 21
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αναφορική' },
			b: { text: 'Αιτιολογική' },
			c: { text: 'Χρονική' },
			d: { text: 'Πλάγια ερωτηματική', isCorrect: true }
		},
		citation: {
			pre: 'Θηραμένης δὲ καὶ οἱ ἄλλοι πρέσβεις ἐπεὶ ἦσαν ἐν Σελλασίᾳ, ἐρωτώμενοι δὲ ',
			highlighted: 'ἐπὶ τίνι λόγῳ ἥκοιεν',
			post: 'εἶπον ὅτι αὐτοκράτορες περὶ εἰρήνης, μετά ταῦτα οἱ ἔφοροι καλεῖν ἐκέλευον αὐτούς. Ἐπεὶ δ’ ἧκον, ἐκκλησίαν ἐποίησαν, ἐν ᾗ ἀντέλεγον Κορίνθιοι καὶ Θηβαῖοι μάλιστα, πολλοὶ δὲ καὶ ἄλλοι τῶν Ἑλλήνων, μὴ σπένδεσθαι Ἀθηναίοις, ἀλλ’ ἐξαιρεῖν.',
			source: {
				chapter: 2,
				verse: 19
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αναφορική' },
			b: { text: 'Ενδοιαστική' },
			c: { text: 'Πλάγια ερωτηματική' },
			d: { text: 'Χρονική', isCorrect: true }
		},
		citation: {
			pre: 'Λακεδαιμόνιοι δὲ οὐκ ἔφασαν πόλιν Ἑλληνίδα ἀνδραποδιεῖν μέγα ἀγαθόν εἰργασμένην ἐν τοῖς μεγίστοις κινδύνοις γενομένοις τῇ Ἑλλάδι, ἀλλ’ ἐποιοῦντο εἰρήνην ',
			highlighted:
				'ἐφ’ ᾧ τά τε μακρά τείχη καὶ τόν Πειραιᾶ καθελόντας καὶ τάς ναῦς πλὴν δώδεκα παραδόντας καὶ τοὺς φυγάδας καθέντας τόν αὐτόν ἐχθρόν καὶ φίλον νομίζοντας Λακεδαιμονίοις ἕπεσθαι καὶ κατά γῆν καὶ κατά θάλατταν',
			post: ' ὅποι ἂν ἡγῶνται.',
			source: {
				chapter: 2,
				verse: 20
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Υποθετική' },
			b: { text: 'Παραχωρητική' },
			c: { text: 'Πλάγια ερωτηματική' },
			d: { text: 'Ενδοιαστική', isCorrect: true }
		},
		citation: {
			pre: 'Θηραμένης δὲ καὶ οἱ σὺν αὐτῷ πρέσβεις ἐπανέφερον ταῦτα εἰς τάς Ἀθήνας. Εἰσιόντας δ’ αὐτοὺς ὄχλος περιεχεῖτο πολύς, φοβούμενοι ',
			highlighted: 'μὴ ἄπρακτοι ἥκοιεν',
			post: '· οὐ γάρ ἔτι ἐνεχώρει μέλλειν διά τό πλῆθος τῶν ἀπολλυμένων τῷ λιμῷ.',
			source: {
				chapter: 2,
				verse: 21
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αποτελεσματική' },
			b: { text: 'Αναφορική' },
			c: { text: 'Χρονική' },
			d: { text: 'Πλάγια ερωτηματική', isCorrect: true }
		},
		citation: {
			pre: 'Τῇ δὲ ὑστεραίᾳ ἀπήγγελλον οἱ πρέσβεις ',
			highlighted: 'ἐφ’ οἷς οἱ Λακεδαιμόνιοι ποιοῖντο τὴν εἰρήνην',
			post: '· προηγόρει δὲ αὐτῶν Θηραμένης, λέγων ὡς χρὴ πείθεσθαι Λακεδαιμονίοις καὶ τά τείχη περιαιρεῖν. Ἀντειπόντων δέ τινων αὐτῷ, πολὺ δὲ πλειόνων συνεπαινεσάντων, ἔδοξε δέχεσθαι τὴν εἰρήνην.',
			source: {
				chapter: 2,
				verse: 22
			}
		}
	},
	{
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Αποτελεσματική' },
			b: { text: 'Χρονική' },
			c: { text: 'Τελική' },
			d: { text: 'Ειδική', isCorrect: true }
		},
		citation: {
			pre: 'Τῇ δὲ ὑστεραίᾳ ἀπήγγελλον οἱ πρέσβεις ἐφ’ οἷς οἱ Λακεδαιμόνιοι ποιοῖντο τὴν εἰρήνην· προηγόρει δὲ αὐτῶν Θηραμένης, λέγων ',
			highlighted: 'ὡς χρὴ πείθεσθαι Λακεδαιμονίοις καὶ τά τείχη περιαιρεῖν',
			post: '. Ἀντειπόντων δέ τινων αὐτῷ, πολὺ δὲ πλειόνων συνεπαινεσάντων, ἔδοξε δέχεσθαι τὴν εἰρήνην.',
			source: {
				chapter: 2,
				verse: 22
			}
		}
	}
];
