import type { Question } from './types';

export const questions: Question[] = [
	{
		difficulty: 'easy',
		type: 'multiple-choice',
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Ειδική' },
			b: { text: 'Πλάγια ερωτηματική' },
			c: { text: 'Αναφορική' },
			d: { text: 'Υποθετική', isCorrect: true }
		},
		citation: {
			pre: 'Τοιούτων δὲ ὄντων Θηραμένης εἶπεν ἐν ἐκκλησίᾳ ὅτι ',
			highlighted: 'εἰ βούλονται αὐτὸν πέμψαι παρά Λύσανδρον',
			post: ', εἰδὼς ἥξει Λακεδαιμονίους πότερον ἐξανδραποδίσασθαι τὴν πόλιν βουλόμενοι ἀντέχουσι περὶ τῶν τειχῶν ἢ πίστεως ἕνεκα. Πεμφθεὶς δὲ διέτριβε παρὰ Λυσάνδρῳ τρεῖς μῆνας καὶ πλείω, ἐπιτηρῶν ὁπότε Ἀθηναῖοι ἔμελλον διὰ τὸ ἐπιλελοιπέναι τὸν σῖτον ἅπαντα ὅ τι τις λέγοι ὁμολογήσειν.',
			source: {
				chapter: 2,
				verse: 16
			}
		},
		book: 'xenophon'
	},
	{
		difficulty: 'easy',
		type: 'multiple-choice',
		prompt: 'Να βρεθεί το είδος της δευτερεύουσας πρότασης',
		answers: {
			a: { text: 'Ειδική' },
			b: { text: 'Πλάγια ερωτηματική' },
			c: { text: 'Αναφορική' },
			d: { text: 'Υποθετική', isCorrect: true }
		},
		citation: {
			pre: 'Τοιούτων δὲ ὄντων Θηραμένης εἶπεν ἐν ἐκκλησίᾳ ὅτι ',
			highlighted: 'εἰ βούλονται αὐτὸν πέμψαι παρά Λύσανδρον',
			post: ', εἰδὼς ἥξει Λακεδαιμονίους πότερον ἐξανδραποδίσασθαι τὴν πόλιν βουλόμενοι ἀντέχουσι περὶ τῶν τειχῶν ἢ πίστεως ἕνεκα. Πεμφθεὶς δὲ διέτριβε παρὰ Λυσάνδρῳ τρεῖς μῆνας καὶ πλείω, ἐπιτηρῶν ὁπότε Ἀθηναῖοι ἔμελλον διὰ τὸ ἐπιλελοιπέναι τὸν σῖτον ἅπαντα ὅ τι τις λέγοι ὁμολογήσειν.',
			source: {
				chapter: 2,
				verse: 16
			}
		},
		book: 'xenophon'
	}
];
