<script lang="ts">
	import Question from './Question.svelte';
	import Highlight from '$lib/Highlight.svelte';
</script>

<!-- ΔΕΙΓΜΑ -->
<Question
	num={1}
	title="Να βρεθεί το είδος της δευτερεύουσας πρότασης"
	answers={{
		a: { text: 'Ειδική' },
		b: { text: 'Πλάγια ερωτηματική' },
		c: { text: 'Αναφορική' },
		d: { text: 'Υποθετική', isCorrect: true }
	}}
>
	[16] Τοιούτων δὲ ὄντων Θηραμένης εἶπεν ἐν ἐκκλησίᾳ ὅτι <Highlight
		>εἰ βούλονται αὐτὸν πέμψαι παρά Λύσανδρον</Highlight
	>, εἰδὼς ἥξει Λακεδαιμονίους πότερον ἐξανδραποδίσασθαι τὴν πόλιν βουλόμενοι ἀντέχουσι περὶ τῶν
	τειχῶν ἢ πίστεως ἕνεκα. Πεμφθεὶς δὲ διέτριβε παρὰ Λυσάνδρῳ τρεῖς μῆνας καὶ πλείω, ἐπιτηρῶν ὁπότε
	Ἀθηναῖοι ἔμελλον διὰ τὸ ἐπιλελοιπέναι τὸν σῖτον ἅπαντα ὅ τι τις λέγοι ὁμολογήσειν.
</Question>
